Repository: BryanEgbert/skripsi
Catalog: frontend/lib/l10n/app_*.arb
Languages: id

source: Welcome to
id: Selamat datang di

# punchLine
source: The smarter way to find pet daycares & connect with vets!
id: Cara lebih cerdas untuk menemukan penitipan hewan & terhubung dengan dokter hewan!

# passwordInputLabel
source: Password
id: Kata sandi

# createAnAccountBtn
source: Create An Account
id: Buat Akun

source: or
id: atau

# petsTitle
source: Pets
id: Hewan Peliharaan

# petCategory
source: Pet category: {category}
id: Kategori hewan: {category}

# editPetTooltip
source: Edit pet
id: Ubah data hewan

# deletePetTooltip
source: Delete pet
id: Hapus data hewan

# editPetInfoTitle
source: Edit Pet Info
id: Ubah Informasi Hewan

# nameLabel
source: Name
id: Nama

# petCategoryLabel
source: Pet category
id: Kategori Hewan

# spayedNeuteredLabel
source: Spayed/Neutered
id: Sudah di Sterilisasi

# saveAddressButton
source: Save Address
id: Simpan Alamat

# nameEmptyError
source: Please enter the Name
id: Silakan masukkan Nama

# petCategoryEmptyError
source: Please select the Pet category
id: Silakan pilih Kategori Hewan

# saveBtn
source: Save
id: Simpan

# petsNav
source: Pets
id: Hewan

# exploreNav
source: Explore
id: Jelajah

# vetsNav
source: Vets
id: Dokter Hewan

# bookingsNav
source: Bookings
id: Pemesanan

source: Back
id: Kembali

source: Pet Vaccination
id: Vaksinasi Hewan Peliharaan

source: Requires Vaccination
id: Membutuhkan Vaksinasi

# noRequiresVaccination
source: Doesn't Require Vaccination
id: Tidak Membutuhkan Vaksinasi

# distanceFilter
source: Distance in kilometer (GPS and location permission must be enabled)
id: Jarak dalam kilometer (GPS dan izin lokasi harus diaktifkan)

# distanceInfo
source: To disable filter by distance, set slider to 0
id: Untuk menonaktifkan penyaringan berdasarkan jarak, atur penggeser ke 0

# maxDistanceInput
source: Max Distance
id: Jarak Maksimum

# minDistanceInput
source: Min Distance
id: Jarak Minimum

source: Price Range
id: Rentang Harga

# priceRangeInfo
source: To disable price range filter, set slider to 0
id: Untuk menonaktifkan penyaringan berdasarkan rentang harga, atur penggeser ke 0

# minPriceInput
source: Min Price
id: Harga Maksimum

# maxPriceInput
source: Max Price
id: Harga Minimum

source: Facilities
id: Fasilitas

source: Messages
id: Pesan

source: Pick-Up Service Provided
id: Layanan Antar-Jemput Disediakan

source: In-House Food Provided
id: Makanan di Tempat Disediakan

source: Grooming Service Provided
id: Layanan Perawatan Disediakan

source: Daily Walks
id: Jalan-Jalan Harian

source: No Walks Provided
id: Tidak Menyediakan Jalan-Jalan

source: One Walk a Day
id: Satu Kali Jalan-Jalan per Hari

source: Two Walks a Day
id: Dua Kali Jalan-Jalan per Hari

source: More Than Two Walks a Day
id: Lebih dari Dua Kali Jalan-Jalan per Hari

source: Daily Playtime
id: Waktu Bermain Harian

source: No Playtime Provided
id: Tidak Menyediakan Waktu Bermain

source: One Play Session a Day
id: Satu Sesi Bermain per Hari

# twoPlaySessionsADay
source: Two Play Session a Day
id: Dua Sesi Bermain per Hari

# moreThanTwoPlaySessionsADay
source: More Than Two Play Session a Day
id: Lebih dari Dua Sesi Bermain per Hari

source: Apply Filter
id: Terapkan Filter

source: Vet Specialties
id: Spesialisasi Dokter Hewan

source: Booking History
id: Riwayat Pemesanan

# cancelBookingConfirmation
source: Are you sure you want to cancel this booking? This action cannot be undone.
id: Apakah Anda yakin ingin membatalkan pemesanan ini? Tindakan ini tidak dapat dibatalkan.

source: Cancel Booking
id: Batalkan Pemesanan

source: Give Review
id: Beri Ulasan

# tapCardsToViewDetails
source: Tap the cards to view details
id: Ketuk kartu untuk melihat detail

# deletePetConfirmation
source: Are you sure you want to delete this pet? This action cannot be undone.
id: Apakah Anda yakin ingin menghapus hewan peliharaan ini? Tindakan ini tidak dapat dibatalkan.

# confirmDeleteTitle
source: Confirm Delete
id: Konfirmasi Hapus

source: Cancel
id: Batal

source: Delete
id: Hapus

source: No
id: Tidak

source: Yes
id: Ya

# specialtiesLabel
source: Specialties: {vetSpecialtyNames}
id: Spesialisasi: {vetSpecialtyNames}

source: Account Settings
id: Pengaturan Akun

source: Edit Profile
id: Ubah Profil

source: Dark Mode
id: Mode Gelap

source: Logout
id: Keluar Dari Akun

source: Edit User Profile
id: Ubah Profil Pengguna

source: Display Name
id: Nama Tampilan

source: Booking Details
id: Detail Pemesanan

source: Reservation Dates
id: Tanggal Reservasi

source: Use Pick-up Service
id: Gunakan Layanan Penjemputan

source: Reserved Pets
id: Hewan yang Dititipkan

source: Pricings
id: Rincian Harga

# turnOnLocationMessage
source: Turn on location to find the nearest pet daycare
id: Aktifkan lokasi untuk menemukan penitipan hewan terdekat

source: Turn On
id: Aktifkan

source: Pet Daycare & Boarding
id: Penitipan Hewan

source: Operational Hour
id: Jam Operasional

source: Requirements
id: Persyaratan

source: Pet Vaccination Required
id: Wajib Vaksinasi Hewan

source: Pet Vaccination Not Required
id: Vaksinasi Hewan Tidak Wajib

# petVaccinationIsRequired
source: Pet vaccination is required to book
id: Vaksinasi hewan diperlukan untuk melakukan pemesanan

# petVaccinationIsNotRequired
source: Unvaccinated pets can book at this daycare
id: Hewan yang belum divaksinasi dapat melakukan pemesanan di tempat ini

source: Additional Services
id: Layanan Tambahan

source: Grooming Service
id: Layanan Grooming

source: Service provided
id: Layanan tersedia

source: Service not provided
id: Layanan tidak tersedia

source: Pick-Up Service
id: Layanan Antar-Jemput

# inHouseFoodProvidedDetails
source: In-House Food Provided
id: Makanan Disediakan

source: Number of Walks
id: Jumlah Jalan-jalan

source: Number of Playtime
id: Jumlah Waktu Bermain

source: View Reviews
id: Lihat Ulasan

# bookSlot
source: Book A Slot
id: Pesan Slot

source: slots booked
id: slot dipesan

# reviewsTitle
source: Reviews
id: Ulasan

# reviewsCount
source: {count} Reviews
id: {count} Ulasan

source: Pick Pets
id: Pilih Hewan Peliharaan

source: Choose Booking Date
id: Pilih Tanggal Pemesanan

# bookingDateLabel
source: Booking Date
id: Tanggal Pemesanan

# bookSlotButton
source: Book Slot
id: Pesan Slot

# chooseAddress
source: Choose an address
id: Pilih alamat

# selectDateRange
source: Please select the available date range
id: Silakan pilih rentang tanggal yang tersedia

# vaccinationRequired
source: Pet must have a valid and up-to-date vaccination record
id: Hewan peliharaan harus memiliki catatan vaksinasi yang valid dan terbaru

# unsupportedPetCategory
source: Pet category not supported
id: Kategori hewan peliharaan tidak didukung

source: Saved Address
id: Alamat Tersimpan

source: Notes
id: Catatan

source: selected
id: dipilih

# deleteAddressConfirmation
source: Are you sure you want to delete this address? This action cannot be undone.
id: Apakah Anda yakin ingin menghapus alamat ini? Tindakan ini tidak dapat dibatalkan.

source: Add Address
id: Tambah Alamat

source: Notes (optional)
id: Catatan (opsional)

# notesExample
source: e.g. Black front door, White wall with 2 plants
id: contoh: Blok 3 No. 2

# location
source: Location Name
id: Nama Lokasi

source: Address
id: Alamat

source: Use Current Location
id: Gunakan Lokasi Saat Ini

# locationRequestDenied
source: Location request denied, please enable location in the settings
id: Permintaan lokasi ditolak, silakan aktifkan lokasi di pengaturan

source: Pet Details
id: Detail Hewan

source: Vaccination Records
id: Catatan Vaksinasi

source: owner: {name}
id: pemilik: {name}

source: Date Administered:
id: Tanggal Vaksinasi

source: Next Due Date:
id: Tanggal Jatuh Tempo

source: Edit
id: Ubah

# petOwner
source: owner: {ownerName}
id: pemilik: {ownerName}

source: Customers
id: Pelanggan

source: Sort by Pets
id: Hewan Peliharaan

source: Sort by Pet Owners
id: Pemilik Hewan

# noBookedPets
source: There are no booked pets
id: Tidak ada hewan peliharaan yang dipesan

# sendPhotoToOwner
source: Send Photo To Pet Owner
id: Kirim Foto ke Pemilik Hewan

# chatPetOwner
source: Chat pet's owner
id: Chat Pemilik Hewan

# noBookedPetOwners
source: There are no booked pet owners
id: Tidak ada pemilik hewan yang melakukan pemesanan

source: Accept
id: Terima

source: Reject
id: Tolak

source: Pick-up required
id: Penjemputan diperlukan

source: Pick-up not required
id: Penjemputan tidak diperlukan

source: Reject Request
id: Tolak Pemesanan

# rejectRequestConfirmation
source: Are you sure you want to reject this booking request? This action cannot be undone.
id: Apakah Anda yakin ingin menolak pemesanan ini? Tindakan ini tidak dapat dibatalkan.

source: Booking Queue
id: Antrian Pemesanan

# myPetDaycare
source: My Service
id: Tempat Penitipan Saya

# setupAccountTitle
source: Let's Set Up Your Account
id: Mari Buat Akun Anda

# setupAccountSubtitle
source: Enter your details to continue
id: Masukkan data diri Anda untuk melanjutkan ke tahap berikutnya

# passwordRequirement
source: Must contain at least 8 characters
id: Harus terdiri dari minimal 8 karakter

source: Next
id: Lanjut

# signupTitle
source: Join Our Pet Daycare Community!
id: Bergabung dengan Komunitas Penitipan Hewan Kami!

# signupSubtitle
source: Choose your role to get started:
id: Pilih peran Anda untuk memulai:

# rolePetOwner
source: Pet Owner
id: Pemilik Hewan

# rolePetOwnerDesc
source: Discover trusted pet daycares & chat with vets.
id: Temukan penitipan hewan terpercaya & ngobrol dengan dokter hewan.

# roleProvider
source: Pet Daycare Provider
id: Penyedia Penitipan Hewan

# roleProviderDesc
source: Connect with pet owners & grow your business.
id: Terhubung dengan pemilik hewan & kembangkan bisnis Anda.

# roleVet
source: Veterinarian
id: Dokter Hewan

# roleVetDesc
source: Provide expert care & guidance to pet owners.
id: Beri perawatan dan panduan ahli untuk pemilik hewan.

source: Add Pet
id: Tambah Hewan

source: Vaccination Record (Optional)
id: Catatan Vaksinasi (Opsional)

source: Fill Pet Info
id: Isi Informasi Hewan

source: Choose pet category
id: Pilih kategori hewan

# enterPetDetails
source: Enter your pet details to continue
id: Masukkan detail hewan peliharaan Anda untuk melanjutkan ke tahap berikutnya

# addVaccinationRecordOptional
source: Add your pet's vaccination record (this step is optional)
id: Tambahkan catatan vaksinasi hewan peliharaan Anda (langkah ini opsional)

source: Create My Account
id: Buat Akun Saya

source: Skip
id: Lewati

# creatingYourAccount
source: Creating Account
id: Membuat Akun

# clickToAddVaccinePhoto
source: Click to add photo of the vaccination record
id: Klik untuk menambahkan foto buku vaksinasi

# enterPetDaycareDetails
source: Enter your pet daycare/hotel details to continue
id: Masukkan detail tempat penitipan/hotel hewan peliharaan Anda untuk melanjutkan

source: Pet Daycare Name
id: Nama Tempat Penitipan Hewan

source: Description (optional)
id: Deskripsi (opsional)

# addPetDaycareImages
source: Add images of your pet daycare (min. 1 image)
id: Tambahkan gambar tempat penitipan hewan Anda (min. 1 gambar)

source: Operating Hours
id: Jam Operasional

source: Opening Hour
id: Jam Buka

source: Closing Hour
id: Jam Tutup

source: to
id: sampai

source: Must contain at least one image
id: Harus ada setidaknya satu gambar

source: Manage Your Pet Slots
id: Kelola Slot

# somethingIsWrongTryAgain
source: Something is wrong, please try again later
id: Terjadi kesalahan, silakan coba lagi nanti

source: Pricing Model
id: Model Harga

source: Dogs
id: Anjing

source: Others
id: Lainnya

source: Accept cats?
id: Menerima kucing?

source: Accept bunnies?
id: Menerima kelinci?

source: Choose Pricing Model
id: Pilih Model Harga

# chargePer
source: Charge per {name}
id: Biaya per {name}

source: Configure Your Services
id: Konfigurasi Layanan Anda

source: Grooming Provided
id: Layanan Grooming Tersedia

source: Pickup Provided
id: Layanan Penjemputan Tersedia

source: Daily Walks Provided
id: Jalan-jalan Harian

source: Daily Playtime Provided
id: Waktu Bermain Harian

# passwordEmpty
source: Password cannot be empty
id: Kata sandi tidak boleh kosong

# passwordTooShort
source: Password must contain at least 8 characters
id: Kata sandi harus memiliki minimal 8 karakter

# fieldCannotBeEmpty
source: This field cannot be empty
id: Bagian ini tidak boleh kosong

# priceEmpty
source: Price cannot be empty
id: Harga tidak boleh kosong

# priceMustBeGreaterThanZero
source: Price must be greater than 0
id: Harga harus lebih dari 0

# invalidSlotNumber
source: Enter a valid slot number
id: Masukkan jumlah slot yang valid

# emailEmpty
source: Email cannot be empty
id: Email tidak boleh kosong

# emailInvalid
source: Email is not valid
id: Format email tidak valid

source: Price
id: Harga

# numberOfSlots
source: # of Slot
id: Jumlah Slot

source: Must accept at least one pet
id: Harus menerima setidaknya satu jenis hewan

# fetchAddressError
source: Something's wrong when fetching address
id: Terjadi kesalahan saat mengambil alamat

# editDaycare
source: Edit Pet Daycare/Hotel
id: Edit Penitipan

# detailsTab
source: Details
id: Detail

# imagesTab
source: Images
id: Gambar

# slotsTab
source: Slots
id: Slot

# servicesTab
source: Services
id: Layanan

source: Invalid location
id: Lokasi tidak valid

# confirmDeleteVaccination
source: Are you sure you want to delete this vaccination record? This action cannot be undone.
id: Apakah Anda yakin ingin menghapus catatan vaksinasi ini? Tindakan ini tidak dapat dibatalkan.

# noVaccinationRecord
source: There are no vaccination record for this pet.
id: Tidak ada catatan vaksinasi untuk hewan peliharaan ini.

# operationSuccess
source: Operation completed successfully.
id: Tindakan berhasil diselesaikan.

source: Unknown Error
id: Kesalahan tidak diketahui

# jwtExpired
source: Session expired
id: Sesi telah berakhir

# userDeleted
source: User has been deleted, please create a new account
id: Pengguna telah dihapus, silakan buat akun baru

# bookingHistoryInfo
source: Your booking history shows here
id: Riwayat pemesanan Anda akan muncul di sini

# failToLoadImage
source: Failed to load image
id: Gagal memuat gambar

source: Preferred Language
id: Bahasa Pilihan

source: Choose Preferred Language
id: Pilih Bahasa Pilihan

# mustChooseOneVetSpecialty
source: Must choose at least one vet specialty
id: Harus memilih setidaknya satu spesialisasi dokter hewan

source: Choose Vet Specialties
id: Pilih Spesialisasi Dokter Hewan

source: Invalid email or password
id: Email atau kata sandi salah

# dataDoesNotExist
source: Data doesn't exist
id: Data tidak ditemukan

source: Pet Info
id: Info Hewan
